[Survived] BlockStatement
src/example.js:1:27
-function fizzbuzz(number) {
-    var result = '';
-    if (number % 3 === 0) {
-        result += 'fizz';     // not "fooz"
-    }
-    if (number % 5 === 0) {
-        result += 'buzz'
-    }
-    return result;
-}
+function fizzbuzz(number) {}
 module.exports = { fizzbuzz };

[Survived] ConditionalExpression
src/example.js:3:9
 function fizzbuzz(number) {
     var result = '';
-    if (number % 3 === 0) {
+    if (true) {
         result += 'fizz';     // not "fooz"
     }

[Survived] BlockStatement
src/example.js:3:27
 function fizzbuzz(number) {
     var result = '';
-    if (number % 3 === 0) {
-        result += 'fizz';     // not "fooz"
-    }
+    if (number % 3 === 0) {}
     if (number % 5 === 0) {
         result += 'buzz'

[Survived] StringLiteral
src/example.js:4:19
 function fizzbuzz(number) {
     var result = '';
     if (number % 3 === 0) {
-        result += 'fizz';     // not "fooz"
+        result += "";     // not "fooz"
     }
     if (number % 5 === 0) {

[Survived] BlockStatement
src/example.js:6:27
     if (number % 3 === 0) {
         result += 'fizz';     // not "fooz"
     }
-    if (number % 5 === 0) {
-        result += 'buzz'
-    }
+    if (number % 5 === 0) {}
     return result;
 }

[Survived] EqualityOperator
src/example.js:6:9
     if (number % 3 === 0) {
         result += 'fizz';     // not "fooz"
     }
-    if (number % 5 === 0) {
+    if (number % 5 !== 0) {
         result += 'buzz'
     }
